manual/combined.org
#+TITLE: Natural Born Cyborgs: An Eternal Golden Braid\newline(Working Title)
#+AUTHOR: Luís Arandas et al.
#+OPTIONS: H:3 num:t toc:nil ':t
#+LATEX_HEADER: \usepackage[a4paper,bindingoffset=0.2in,left=1in,right=1in,top=1in,bottom=1in,footskip=.25in]{geometry}
#+LATEX_HEADER: \usepackage[dvipsnames]{xcolor}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage[math-style=french]{unicode-math}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \setmathfont[math-style=upright]{DejaVu Sans Mono}
#+LATEX_HEADER: \setmonofont[scale=.8,Color=blue]{Ubuntu Mono}
#+LATEX_HEADER: \newfontfamily{\mm}[scale=.8,Color=red]{DejaVu Sans Mono}
#+LATEX_HEADER: \setmainfont[BoldFont=EB Garamond,BoldFeatures={Color=ff0000}]{EB Garamond}
#+LATEX_HEADER: \newcommand{\hookuparrow}{\mathrel{\rotatebox[origin=c]{90}{$\hookrightarrow$}}}
#+LATEX_HEADER: \usepackage{fix-abstract}
#+LATEX_HEADER: \definecolor{pale}{HTML}{fffff8}
#+LATEX_HEADER: \definecolor{orgone}{HTML}{83a598}
#+LATEX_HEADER: \definecolor{orgtwo}{HTML}{fabd2f}
#+LATEX_HEADER: \definecolor{orgthree}{HTML}{d3869b}
#+LATEX_HEADER: \definecolor{orgfour}{HTML}{fb4933}
#+LATEX_HEADER: \definecolor{orgfive}{HTML}{b8bb26}
#+LATEX_HEADER: \definecolor{gruvbg}{HTML}{1d2021}
#+LATEX_HEADER: \newenvironment*{emptyenv}{}{}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \sectionfont{\normalfont\color{red}\selectfont}        
#+LATEX_HEADER: \subsectionfont{\normalfont\selectfont}     
# #+LATEX_HEADER: \subsubsectionfont{\normalfont\selectfont}
#+LATEX_HEADER: \paragraphfont{\normalfont\selectfont}
#+LATEX_HEADER: \subsubsectionfont{\normalfont\selectfont\color{black!50}}
**
#+BEGIN_LATEX
\begin{abstract}
\noindent
The aim of this paper to re-imagine “Human Computer Interaction” as a
co-evolutionary process.  We address this through a detailed
reconsideration of the concepts “creativity” and “ethics”.  The
motivation for the investigation is that ethics also hard for humans
to get right — e.g., consider ongoing concerns about climate change,
genocides, etc. — so, accordingly, it becomes relevant to consider
computational ethics not just in terms abstractions like trolley
problems, but within a concrete historical context.  Similarly, we are
led to look at “creativity” not in terms of an auteur — or even
necessarily a single agent, but in terms of systems interaction.  By
bringing together philosophical and computing literature, we hope to
develop a set of salient ethical guidelines for researchers and
practitioners in computing fields.
\end{abstract}
#+END_LATEX
** \setcounter{tocdepth}{1}
\tableofcontents
# IMPORT
* Introduction
** The Introduction will have to do some heavy lifting to explain that we're talking about "creativity" in a way that's not entirely familiar. I want to re-imagine "Human Computer Interaction" as a co-evolutionary process that has been developing over long time spans. There's nothing too shocking about that, but it can be hard to express in words. To make the paper accessible to reviewers we need to be careful how we present our concepts of "creativity" and "ethics". The basic motivation is that ethics is pretty hard for humans to get right (e.g., consider climate change, genocides, etc.), so we need to think about computational ethics not just in terms of trolley problems, but in a broader context. Similarly, we want to look at “creativity” not just in terms of an auteur — or even necessarily a single agent!
** [[*Premises][Premises]] — /‘Human-computer interaction’ is a bigger deal than we might think at first glance!.../
** [[*Scope][Scope]]— TOCHI — /covers humans interacting with computers/
:PROPERTIES:
:later: 1607173640608
:done: 1607173639362
:END:
*** Our RQ: WHAT ARE SUITABLE ETHICS FOR HCI+HCCC DESIGNERS?
** [[*Approach][Approach]] — /We will survey philosophy and its applications in CS; then, we will describe possible next steps for research./
* Approach
:PROPERTIES:
  :tag: HL
  :END:

** Main idea survey philosophical ideas that are relevant and look at how they are used in practice.
- We want to look at what is HCCC, how does it work overall, how this influence scientists in the practice
** An inspiring model: “Peer Production: A Form of Collective Intelligence” (Benkler et al.)
#+begin_quote
In the rest of this chapter, we describe the development of the
academic literature on peer production and collective intelligence in
three areas – organization, motivation, and quality. In each area, we
introduce foundational work consisting primarily of earlier
scholarship that sought to describe peer production and establish its
legitimacy. Subsequently, we characterize work, usually more recent,
that seeks to pursue new directions and to derive more nuanced
analytical insights. — https://mako.cc/benkler_shaw_hill-peer_production_ci.pdf
#+end_quote
* Index of Ethics Paper
:PROPERTIES:
  :tag: HL
  :END:

** [[*Introduction][Introduction]] — Ethics of HCCC
*** [[*Background][Background]] — /Bring people up to speed with what we need to think about “HCCC” the broad way we talk about it./
** Philosophy and Ethics — Intersected with Computer Science Practice
*** [[*Survey introduction][Survey introduction]]
*** Western philosophy and ethics definition (as basic for the paper) [[*1.0][1.0]]
*** Relating western to nonwestern practices [[*2.0][2.0]]
*** Phenomenology and being [[*3.0][3.0]]
*** Embodied cognition, social intelligence, collective intelligence [[*4.0][4.0]]
*** Reprise: Evolution regarding all of these [[*5.0][5.0]]
** [[*Case studies][Case studies]] — if wanted
** [[*Discussion][Discussion]] How can we build on the survey above to plan new directions of work?
* Background
:PROPERTIES:
  :tag: HL
  :END:

** [[*Background: Concepts][Background: Concepts]]
** [[*Background: HCCC][Background: HCCC]]
** [[*Background: Other][Background: Other]]
(For miscellaneous stuff.)
* Background: Concepts
:PROPERTIES:
  :tag: HL
  :END:

#+begin_quote
At this point our aim is to set up the framework for reviewers to
evaluate the paper’s contributions, not to dazzle them with esoteric
concepts!  Nevertheless some framing concepts can be helpful.
#+end_quote

** Philosophy:
- “Creative evolution” from Bergson
- “Anthropotechnics” from Sloterdijk.
** Anthropology:
- “Chaîne opératoire” from André Leroi-Gourhan et al.
- Histories of the evolution of intelligence (sociality & tools being key focal points)
** Computing
- “Computational Social Creativity” is one sub-field of computing research that is apropos, because it considers creativity spread across a social field.
** Other fields:
- “Professional ethics” (e.g., with reference to medicine, physics, etc).

* Background: HCCC
:PROPERTIES:
  :tag: HL
  :END:

** When we talk about Human-Computer Co-Creativity, what are we talking about?
We want to establish the setting in which people can understand what we’re talking about.
