manual/combined.tex
% Created 2020-12-23 Wed 20:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,bindingoffset=0.2in,left=1in,right=1in,top=1in,bottom=1in,footskip=.25in]{geometry}
\usepackage[dvipsnames]{xcolor}
\usepackage{fontspec}
\usepackage[math-style=french]{unicode-math}
\usepackage{mathtools}
\setmathfont[math-style=upright]{DejaVu Sans Mono}
\setmonofont[scale=.8,Color=blue]{Ubuntu Mono}
\newfontfamily{\mm}[scale=.8,Color=red]{DejaVu Sans Mono}
\setmainfont[BoldFont=EB Garamond,BoldFeatures={Color=ff0000}]{EB Garamond}
\newcommand{\hookuparrow}{\mathrel{\rotatebox[origin=c]{90}{$\hookrightarrow$}}}
\usepackage{fix-abstract}
\definecolor{pale}{HTML}{fffff8}
\definecolor{orgone}{HTML}{83a598}
\definecolor{orgtwo}{HTML}{fabd2f}
\definecolor{orgthree}{HTML}{d3869b}
\definecolor{orgfour}{HTML}{fb4933}
\definecolor{orgfive}{HTML}{b8bb26}
\definecolor{gruvbg}{HTML}{1d2021}
\newenvironment*{emptyenv}{}{}
\usepackage{sectsty}
\sectionfont{\normalfont\color{red}\selectfont}
\subsectionfont{\normalfont\selectfont}
\paragraphfont{\normalfont\selectfont}
\subsubsectionfont{\normalfont\selectfont\color{black!50}}
\author{Luís Arandas et al.}
\date{\today}
\title{Natural Born Cyborgs: An Eternal Golden Braid\newline(Working Title)}
\hypersetup{
 pdfauthor={Luís Arandas et al.},
 pdftitle={Natural Born Cyborgs: An Eternal Golden Braid\newline(Working Title)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{abstract}
\noindent
The aim of this paper to re-imagine “Human Computer Interaction” as a
co-evolutionary process.  We address this through a detailed
reconsideration of the concepts “creativity” and “ethics”.  The
motivation for the investigation is that ethics also hard for humans
to get right — e.g., consider ongoing concerns about climate change,
genocides, etc. — so, accordingly, it becomes relevant to consider
computational ethics not just in terms abstractions like trolley
problems, but within a concrete historical context.  Similarly, we are
led to look at “creativity” not in terms of an auteur — or even
necessarily a single agent, but in terms of systems interaction.  By
bringing together philosophical and computing literature, we hope to
develop a set of salient ethical guidelines for researchers and
practitioners in computing fields.
\end{abstract}

\setcounter{tocdepth}{1}
\tableofcontents
\section{Introduction}
\label{sec:orga13a53c}
\subsection{The Introduction will have to do some heavy lifting to explain that we're talking about ``creativity'' in a way that's not entirely familiar. I want to re-imagine ``Human Computer Interaction'' as a co-evolutionary process that has been developing over long time spans. There's nothing too shocking about that, but it can be hard to express in words. To make the paper accessible to reviewers we need to be careful how we present our concepts of ``creativity'' and ``ethics''. The basic motivation is that ethics is pretty hard for humans to get right (e.g., consider climate change, genocides, etc.), so we need to think about computational ethics not just in terms of trolley problems, but in a broader context. Similarly, we want to look at “creativity” not just in terms of an auteur — or even necessarily a single agent!}
\label{sec:org1456544}
\subsection{\hyperref[sec:org84f8193]{Premises} — \emph{‘Human-computer interaction’ is a bigger deal than we might think at first glance!\ldots{}}}
\label{sec:org08bda59}
\subsection{\hyperref[sec:org20e667e]{Scope}— TOCHI — \emph{covers humans interacting with computers}}
\label{sec:org6d7f577}
\subsubsection{Our RQ: WHAT ARE SUITABLE ETHICS FOR HCI+HCCC DESIGNERS?}
\label{sec:orgdd29601}
\subsection{\hyperref[sec:orgf4c7de5]{Approach} — \emph{We will survey philosophy and its applications in CS; then, we will describe possible next steps for research.}}
\label{sec:org11b292a}
\section{Approach}
\label{sec:orgf4c7de5}
\subsection{Main idea survey philosophical ideas that are relevant and look at how they are used in practice.}
\label{sec:orgec475e8}
\begin{itemize}
\item We want to look at what is HCCC, how does it work overall, how this influence scientists in the practice
\end{itemize}
\subsection{An inspiring model: “Peer Production: A Form of Collective Intelligence” (Benkler et al.)}
\label{sec:org5837ab1}
\begin{quote}
In the rest of this chapter, we describe the development of the
academic literature on peer production and collective intelligence in
three areas – organization, motivation, and quality. In each area, we
introduce foundational work consisting primarily of earlier
scholarship that sought to describe peer production and establish its
legitimacy. Subsequently, we characterize work, usually more recent,
that seeks to pursue new directions and to derive more nuanced
analytical insights. — \url{https://mako.cc/benkler\_shaw\_hill-peer\_production\_ci.pdf}
\end{quote}
\section{Index of Ethics Paper}
\label{sec:orgafe7207}
\subsection{\hyperref[sec:orga13a53c]{Introduction} — Ethics of HCCC}
\label{sec:org2f5e893}
\subsubsection{\hyperref[sec:org71daf48]{Background} — \emph{Bring people up to speed with what we need to think about “HCCC” the broad way we talk about it.}}
\label{sec:orgd7f349e}
\subsection{Philosophy and Ethics — Intersected with Computer Science Practice}
\label{sec:org7c7d609}
\subsubsection{\hyperref[sec:org6c6ca17]{Survey introduction}}
\label{sec:org123b528}
\subsubsection{Western philosophy and ethics definition (as basic for the paper) \hyperref[sec:org6bf393e]{1.0}}
\label{sec:org2c02f3f}
\subsubsection{Relating western to nonwestern practices \hyperref[sec:org017783c]{2.0}}
\label{sec:orge8198d1}
\subsubsection{Phenomenology and being \hyperref[sec:orgcbc9a7d]{3.0}}
\label{sec:org8f1f0b3}
\subsubsection{Embodied cognition, social intelligence, collective intelligence \hyperref[sec:orgda41c79]{4.0}}
\label{sec:org3036604}
\subsubsection{Reprise: Evolution regarding all of these \hyperref[sec:org887356d]{5.0}}
\label{sec:orgdecbff4}
\subsection{\hyperref[sec:orga7d5b63]{Case studies} — if wanted}
\label{sec:org7804f2a}
\subsection{\hyperref[sec:orgb1f7b9a]{Discussion} How can we build on the survey above to plan new directions of work?}
\label{sec:org5a151e9}
\section{Background}
\label{sec:org71daf48}
\subsection{\hyperref[sec:org1164c4f]{Background: Concepts}}
\label{sec:org3ba4eb5}
\subsection{\hyperref[sec:org2aca6e0]{Background: HCCC}}
\label{sec:org1162a31}
\subsection{\hyperref[sec:orgaefd206]{Background: Other}}
\label{sec:org61f7f33}
(For miscellaneous stuff.)
\section{Background: Concepts}
\label{sec:org1164c4f}
\begin{quote}
At this point our aim is to set up the framework for reviewers to
evaluate the paper’s contributions, not to dazzle them with esoteric
concepts!  Nevertheless some framing concepts can be helpful.
\end{quote}

\subsection{Philosophy:}
\label{sec:org72ee4ef}
\begin{itemize}
\item “Creative evolution” from Bergson
\item “Anthropotechnics” from Sloterdijk.
\end{itemize}
\subsection{Anthropology:}
\label{sec:orgbbe6abf}
\begin{itemize}
\item “Chaîne opératoire” from André Leroi-Gourhan et al.
\item Histories of the evolution of intelligence (sociality \& tools being key focal points)
\end{itemize}
\subsection{Computing}
\label{sec:orgf4096d0}
\begin{itemize}
\item “Computational Social Creativity” is one sub-field of computing research that is apropos, because it considers creativity spread across a social field.
\end{itemize}
\subsection{Other fields:}
\label{sec:org569dc83}
\begin{itemize}
\item “Professional ethics” (e.g., with reference to medicine, physics, etc).
\end{itemize}

\section{Background: HCCC}
\label{sec:org2aca6e0}
\subsection{When we talk about Human-Computer Co-Creativity, what are we talking about?}
\label{sec:org36c0d13}
We want to establish the setting in which people can understand what we’re talking about.
