manual/combined.org
*** From Anna's [[https://research.aalto.fi/en/publications/five-cs-for-humancomputer-co-creativity-an-update-on-classical-cr][paper]]:
#+BEGIN_QUOTE
The new framework allows the attribution of creativity not only to individual creators but to a collective of creators, recognising the importance of meta-level communication to the creative collaboration, and the variety of creative contributions that emerge during a co-creative process. It also elaborates on the different communities and contexts surrounding co-creative collaboration and thus facilitates the analysis, evaluation and study of human–computer co-creativity by allowing researchers to describe and situate their work in the field.
#+END_QUOTE

* Background: Other
:PROPERTIES:
  :tag: HL
  :END:

** Bergson’s definition of "creativity" might be confusing for people, but it might be the the one we need to address our RQ.
https://plato.stanford.edu/entries/bergson/#CreaEvol
** Existing books about “creativity and ethics” and "technology and virtues" don’t quite cut the mustard
*** TODO Say why these aren’t sufficient answers to our questions
**** "Creativity and Ethics"
**** "Technology and the virtues: A philosophical guide to a future worth wanting"

* Survey introduction
:PROPERTIES:
  :tag: HL
  :END:

*** Assuming we have the core concepts established, the survey section should be easy to write.
Basic plan: I imagine a call ("A") and response ("B") setup. The (A)
theme is to look at what people have said in various "philosophical"
traditions — Western, nonwestern, phenomenological, experimental. The
(B) theme is to look at how these traditions have been received within
HCI and Computational Creativity research — if at all. In other words,
this is a parallel survey of two different bodies of text, drawing
connections between them. While there could be a lot of reading here,
the writing part is basically procedural.  Furthermore, we could break
down the tasks in different sub-sections to make it more focused. One
nice model for this structure of writing is [[https://mako.cc/benkler_shaw_hill-peer_production_ci.pdf][Benkler, Shaw, and Hill]]
Some methodological questions we can ask about the computing papers:
do the papers consider ethics at all? Have they sought ethics
approval?  Is ethics considered in only an immediate sense (like in a
psychology experiment) or in a broader sense (e.g., free software)? We
could also look at critical literature (e.g., dealing with AI
bias). At the end of this section, we should understand the different
extant practical approaches to ethics, and how they’re grounded in
philosophy. We can use boundary lines like “HCI” and “co-creativity”
as selection criteria to make sure that we don’t include everything.
*** [[*Main References][Main References]]
*** Based on what's raised in §1, create a taxonomic framework for the rest of the paper
This subsection should correspond to the conclusion of this section and connect all of these to subsequent *.B 
** 1.0

*** Western philosophy and ethics summary [[*1.A][1.A]]
*** How do people talk about mainstream ethics in CS? [[*1.B][1.B]]
** 1.A

*** Aristotelian vs Platonic
*** Kant and the categorical imperative
*** David Hume on the problem of induction
*** Maybe talk about the authors that break down cognitivism and agree or not - dualists, functionalists, materialists etc
*** All of this connects to philosophy of mind. Maybe necessary?
*** go deep maybe into pre-aristotle

** 1.B

Need to establish keywords from 1.A to search the literature with!
**** At this level one broadly relevant category is "law"
***** And, in particular, one sub-category is
** 2.0

*** Survey of (relevant) non-western philosophies and ethics [[*2.A][2.A]]
*** Survey of related non-western thought (e.g., *decolonial approaches* to AI) [[*2.B][2.B]]
** 2.A

*** panpsychism, buddhism, animism, ubuntu
(all universe is alive and updating materialism) - which not
necessarily might be eastern but bridge with what doesnt exist
** 2.B

What's called decolonial AI, looking at international thinking about
this — antiwestern in a way.
** 3.0

*** Phenomenology and related philosophies [[*3.A][3.A]]
*** CS/ethics related to phenomenology [[*3.B][3.B]]
** 3.A

*** husserl and heidegger all the way - what is it to be alive. 
May not be necessary to go into this - and on next chapter computational neuroscience vs all these philosophical questions might be a problem.)
*** preontology - and going to what he breaks down
*** be careful to connect this - being and everything - with ethics - Wittgenstein (ethics and aesthetics are one and the same)

** 3.B

TBA
** 4.0

It seems that philosophy has become physicalized in psychology
(Helmholtz, Kant, Freud, Jung), leading up to contemporary cognitive
science.
*** Philosophy of Cog Sci and friends [[*4.A][4.A]]
*** HCCC Ethics of Cog Sci and friends [[*4.B][4.B]]
** 4.A

*** Metacognition and ethical judgement - (maybe connect to the title here, and bring cognitive psychology to the discussion (behaviour))
*** Modelling ethics and cognition
*** Predictive Processing and Active Inference (bring embodiment to the discussion here)
*** “Ethical AI”
** 4.B

Here we look at the CS literature that incorporates an ethics related
to “Cog Sci and friends”.

*** This seems to relate to the topics discussed in [[*How AI can be a force for good][How AI can be a force for good]]
In particular, the part about “distributed agency” seems like a
cog-sci related topic.
** 5.0

Talking about human, cognitive, cultural evolution regarding all of these positions.

*** Maybe survey what is common to all of them? and how do this constraints; maybe add cultural differences and analogies;
*** Current research and breakthroughs on cognition and ethical selfawareness; metacognition and world philosophy;
*** Evolution of western thought - connections between philosophy and cognitive science.
Set up a launching pad for thinking about next steps beyond the survey.
*** Notice that now that computers are involved, the way we think about ethics and so on is likely to change.
* Case studies
:PROPERTIES:
  :tag: HL
  :END:

*** Assuming we hold on to this section, it allows us a deeper dive into some examples. Case studies would allow us to look at the concepts we've discussed in the previous sections in a real-world context. However, we’d want to be sure that these aren’t just “tacked on.” Possible examples:
**** Maybe robots?
**** [[*Mathematical creativity][Mathematical creativity]] throughout time
**** Social machines
**** [[*Logseq and friends][Logseq and friends]] — This could be a good one because it relates to the primary tool that we're using for writing this paper
** Logseq and friends

**** Logseq is part of a history of tool evolution that includes Roam Research, which has been massively capitalized recently
