manual/combined.tex
\subsubsection{From Anna's \href{https://research.aalto.fi/en/publications/five-cs-for-humancomputer-co-creativity-an-update-on-classical-cr}{paper}:}
\label{sec:org14065b5}
\begin{quote}
The new framework allows the attribution of creativity not only to individual creators but to a collective of creators, recognising the importance of meta-level communication to the creative collaboration, and the variety of creative contributions that emerge during a co-creative process. It also elaborates on the different communities and contexts surrounding co-creative collaboration and thus facilitates the analysis, evaluation and study of human–computer co-creativity by allowing researchers to describe and situate their work in the field.
\end{quote}

\section{Background: Other}
\label{sec:orgaefd206}
\subsection{Bergson’s definition of ``creativity'' might be confusing for people, but it might be the the one we need to address our RQ.}
\label{sec:orgd72aad0}
\url{https://plato.stanford.edu/entries/bergson/\#CreaEvol}
\subsection{Existing books about “creativity and ethics” and ``technology and virtues'' don’t quite cut the mustard}
\label{sec:org820cec5}
\subsubsection{{\bfseries\sffamily TODO} Say why these aren’t sufficient answers to our questions}
\label{sec:org21e304b}
\begin{enumerate}
\item ``Creativity and Ethics''
\label{sec:org51dfd37}
\item ``Technology and the virtues: A philosophical guide to a future worth wanting''
\label{sec:org4abc9ba}
\end{enumerate}

\section{Survey introduction}
\label{sec:org6c6ca17}
\subsubsection{Assuming we have the core concepts established, the survey section should be easy to write.}
\label{sec:orgb916ad8}
Basic plan: I imagine a call (``A'') and response (``B'') setup. The (A)
theme is to look at what people have said in various ``philosophical''
traditions — Western, nonwestern, phenomenological, experimental. The
(B) theme is to look at how these traditions have been received within
HCI and Computational Creativity research — if at all. In other words,
this is a parallel survey of two different bodies of text, drawing
connections between them. While there could be a lot of reading here,
the writing part is basically procedural.  Furthermore, we could break
down the tasks in different sub-sections to make it more focused. One
nice model for this structure of writing is \href{https://mako.cc/benkler\_shaw\_hill-peer\_production\_ci.pdf}{Benkler, Shaw, and Hill}
Some methodological questions we can ask about the computing papers:
do the papers consider ethics at all? Have they sought ethics
approval?  Is ethics considered in only an immediate sense (like in a
psychology experiment) or in a broader sense (e.g., free software)? We
could also look at critical literature (e.g., dealing with AI
bias). At the end of this section, we should understand the different
extant practical approaches to ethics, and how they’re grounded in
philosophy. We can use boundary lines like “HCI” and “co-creativity”
as selection criteria to make sure that we don’t include everything.
\subsubsection{\hyperref[sec:orgaab3331]{Main References}}
\label{sec:org9bee49a}
\subsubsection{Based on what's raised in §1, create a taxonomic framework for the rest of the paper}
\label{sec:orgd2ace76}
This subsection should correspond to the conclusion of this section and connect all of these to subsequent *.B 
\subsection{1.0}
\label{sec:org6bf393e}

\subsubsection{Western philosophy and ethics summary \hyperref[sec:org96c939c]{1.A}}
\label{sec:orgaaa9f87}
\subsubsection{How do people talk about mainstream ethics in CS? \hyperref[sec:org1be32c3]{1.B}}
\label{sec:orgaf6a652}
\subsection{1.A}
\label{sec:org96c939c}

\subsubsection{Aristotelian vs Platonic}
\label{sec:org3bef0e2}
\subsubsection{Kant and the categorical imperative}
\label{sec:org2c65138}
\subsubsection{David Hume on the problem of induction}
\label{sec:orgfad2815}
\subsubsection{Maybe talk about the authors that break down cognitivism and agree or not - dualists, functionalists, materialists etc}
\label{sec:org800d2fa}
\subsubsection{All of this connects to philosophy of mind. Maybe necessary?}
\label{sec:orgb0a52e0}
\subsubsection{go deep maybe into pre-aristotle}
\label{sec:orgf4f0cd1}

\subsection{1.B}
\label{sec:org1be32c3}

Need to establish keywords from 1.A to search the literature with!
\begin{enumerate}
\item At this level one broadly relevant category is ``law''
\label{sec:org0b1c46a}
\begin{enumerate}
\item And, in particular, one sub-category is
\label{sec:org03fa69e}
\end{enumerate}
\end{enumerate}
\subsection{2.0}
\label{sec:org017783c}

\subsubsection{Survey of (relevant) non-western philosophies and ethics \hyperref[sec:orgb61553b]{2.A}}
\label{sec:orgeb3534c}
\subsubsection{Survey of related non-western thought (e.g., \textbf{decolonial approaches} to AI) \hyperref[sec:orgfaccdba]{2.B}}
\label{sec:orge7ef739}
\subsection{2.A}
\label{sec:orgb61553b}

\subsubsection{panpsychism, buddhism, animism, ubuntu}
\label{sec:org399718d}
(all universe is alive and updating materialism) - which not
necessarily might be eastern but bridge with what doesnt exist
\subsection{2.B}
\label{sec:orgfaccdba}

What's called decolonial AI, looking at international thinking about
this — antiwestern in a way.
\subsection{3.0}
\label{sec:orgcbc9a7d}

\subsubsection{Phenomenology and related philosophies \hyperref[sec:org8815f23]{3.A}}
\label{sec:org6689ef3}
\subsubsection{CS/ethics related to phenomenology \hyperref[sec:orgd8ccb82]{3.B}}
\label{sec:org41a7111}
\subsection{3.A}
\label{sec:org8815f23}

\subsubsection{husserl and heidegger all the way - what is it to be alive.}
\label{sec:org87bf5a3}
May not be necessary to go into this - and on next chapter computational neuroscience vs all these philosophical questions might be a problem.)
\subsubsection{preontology - and going to what he breaks down}
\label{sec:orge218182}
\subsubsection{be careful to connect this - being and everything - with ethics - Wittgenstein (ethics and aesthetics are one and the same)}
\label{sec:org2111405}

\subsection{3.B}
\label{sec:orgd8ccb82}

TBA
\subsection{4.0}
\label{sec:orgda41c79}

It seems that philosophy has become physicalized in psychology
(Helmholtz, Kant, Freud, Jung), leading up to contemporary cognitive
science.
\subsubsection{Philosophy of Cog Sci and friends \hyperref[sec:orgd80447c]{4.A}}
\label{sec:org23e5688}
\subsubsection{HCCC Ethics of Cog Sci and friends \hyperref[sec:org5d87364]{4.B}}
\label{sec:org1a4fb92}
\subsection{4.A}
\label{sec:orgd80447c}

\subsubsection{Metacognition and ethical judgement - (maybe connect to the title here, and bring cognitive psychology to the discussion (behaviour))}
\label{sec:org6f75814}
\subsubsection{Modelling ethics and cognition}
\label{sec:org8413f59}
\subsubsection{Predictive Processing and Active Inference (bring embodiment to the discussion here)}
\label{sec:org1243dcb}
\subsubsection{“Ethical AI”}
\label{sec:org48937bd}
\subsection{4.B}
\label{sec:org5d87364}

Here we look at the CS literature that incorporates an ethics related
to “Cog Sci and friends”.

\subsubsection{This seems to relate to the topics discussed in \hyperref[sec:orgbedef93]{How AI can be a force for good}}
\label{sec:org2c8202a}
In particular, the part about “distributed agency” seems like a
cog-sci related topic.
\subsection{5.0}
\label{sec:org887356d}

Talking about human, cognitive, cultural evolution regarding all of these positions.

\subsubsection{Maybe survey what is common to all of them? and how do this constraints; maybe add cultural differences and analogies;}
\label{sec:orgb7d0b05}
\subsubsection{Current research and breakthroughs on cognition and ethical selfawareness; metacognition and world philosophy;}
\label{sec:orga71a894}
\subsubsection{Evolution of western thought - connections between philosophy and cognitive science.}
\label{sec:org270820e}
Set up a launching pad for thinking about next steps beyond the survey.
\subsubsection{Notice that now that computers are involved, the way we think about ethics and so on is likely to change.}
\label{sec:org884fd35}
\section{Case studies}
\label{sec:orga7d5b63}
\subsubsection{Assuming we hold on to this section, it allows us a deeper dive into some examples. Case studies would allow us to look at the concepts we've discussed in the previous sections in a real-world context. However, we’d want to be sure that these aren’t just “tacked on.” Possible examples:}
\label{sec:orgbd4f311}
\begin{enumerate}
\item Maybe robots?
\label{sec:org28062fc}
\item \hyperref[sec:org36972a8]{Mathematical creativity} throughout time
\label{sec:orgea179e9}
\item Social machines
\label{sec:org96b9110}
\item \hyperref[sec:orge34f081]{Logseq and friends} — This could be a good one because it relates to the primary tool that we're using for writing this paper
\label{sec:org9112a2a}
\end{enumerate}
\subsection{Logseq and friends}
\label{sec:orge34f081}

\begin{enumerate}
\item Logseq is part of a history of tool evolution that includes Roam Research, which has been massively capitalized recently
\label{sec:org8d52c30}
