manual/combined.org
**** Other relevant tools in the same space include Org Roam (that one is open source)
**** Logseq itself is open source
**** The software is linked with a pseudo-ethical method: zettelkasten
***** https://en.wikipedia.org/wiki/Zettelkasten
**** I previously worked on a paper in this space: Massively distributed authorship of academic papers
Tomlinson, B., Ross, J., André, P., et al. 2012. Massively distributed authorship of academic papers. CHI’12 Extended Abstracts on Human Factors in Computing Systems, ACM, 11–20.



** How AI can be a force for good

*** Distributed agency
#+BEGIN_QUOTE
With distributed agency comes distributed responsibility. Existing ethical frameworks address individual, human responsibility, with the goal of allocating punishment or reward based on the actions and intentions of an individual. They were not developed to deal with distributed
responsibility.
#+END_QUOTE
**** https://drive.google.com/drive/u/1/folders/13bwMQfn8RY67-znVdnC7WO6OdcpDtR83
**** This seems like an important point: we'll need new (not necessarily "agential") ways to think about ethics.
**** It seems useful to apply this in somewhat more general terms about "intelligent systems" — or just "systems with emergent properties"; so, if distributed agents produce e.g., environmental degradation, that's not ethical, and the system as a whole "should" find ways to improve its behaviour.  This sort of thing is thought about in Elinor Ostrom's economics.
**** A particular concern of Taddeo & Floridi here seems to be "autonomy" of AI, and "self-determination" of humans. But in the case of HCI/HCCC it's not totally clear that either of these criteria apply.  In HCCC it's much closer to anthropotechnics
***** https://www.wired.com/beyond-the-beyond/2015/09/peter-sloterdijk-anthropotechnics/

*** Regulation
#+BEGIN_QUOTE
Humanity learned this lesson the hard way when it did not regulate the impact of the industrial revolution on labor forces, and also when it recognized too late the environmental impact of massive industrialization and global consumerism.
#+END_QUOTE
**** I think it's worthwhile to think of these things as *not separate* from AI issues
***** Supplementary info:
https://science.sciencemag.org/content/suppl/2018/08/22/361.6404.751.DC1
** Mathematical creativity

*** Section introduction: Objectives
Have we built up enough of a repertoire to do a deep dive on mathematical creativity?
*** What is mathematics? martin heidegger anything learnable as such. Jorge Luís Borges - the map argument;
*** The end of cognition and human ability? The limits of reality and the limits of math (e.g. dimensionality)
*** Mathematical creativity as an example - and so what in what ways does it actually ramifies

* Discussion
:PROPERTIES:
  :tag: HL
  :END:

*** The Discussion is a bit hard to chart in advance, but roughly it asks: having done this survey, and looked at a couple case studies, have we learned anything that's relevant for practice? Maybe here is a good time to return to some of the debates that look at "creativity" in a more mainstream sense, e.g., Anna Kantosalo and Ben Schneiderman about creative systems and social inclusion vs exclusion? From the point of view of "Methods", hopefully we will have clarified at the start why we think this sort of activity could lead to new insights! Now, at the end, we might draw some conclusions about how "HCI" allows us to do global research, build projects involving people from around the world, with rich access to the world’s knowledge resources. We might also have something to say about why Ethical AI is so trendy right now, and perhaps even speculate a bit about its future!
*** Some possible places this could go:
**** How can I practically engage with these issues as a computer science researcher?
**** Tech design and CS thinking: creativity as mirror of ethical principles
**** Research Ethics
**** Interfaces and establishing relationships between people and things?
**** How do I relate to knowledge, and with/to the whole body of historical philosophy, science, inquiry, and maybe AI and tech systems?
** mind

**** What does mind mean?
**** What is mind
** Premises

*** We’ve entered into a new era, and we need to understand what’s going on.
*** Although part of this is the legacy of the industrial revolution, computers have played a significant role in the growth of knowledge
*** In a certain sense the CS field is playing “catch-up” with CMC: we invent new paradigms for interaction (e.g., Wikipedia, machine learning)
*** However, we don’t yet have a robust way to /think/ about human computer interaction at this broad scale
*** We try to wrap our minds around “Human-Computer Co-Creativity” by looking at CMC, HCI, and CI.
Let’s work our way up to discussing HCCC by starting with “human
co-creativity using computers”, and introduce AI once we have a grasp
of how computer mediated communication and collective intelligence
works.


** Scope

*** TOCHI’s statement of purpose

#+begin_quote
ACM Transactions on Computer-Human Interaction (TOCHI) covers the
software, hardware and human aspects of interaction with
computers. Topics include hardware and software architectures;
interactive techniques, metaphors, and evaluation; user interface
design processes; and users and groups of users. Those within the
artificial intelligence, object-oriented systems, information systems,
graphics and software engineering communities, will benefit from the
high quality research papers in TOCHI concerning information and ideas
directly related to the construction of effective human-computer
interfaces.
#+end_quote

*** Our research question within this area:
**** Is there an ethical use of computer technology, and if so, what is it?  How would we get intuitions about that?
**** What is our orientation towards computers broadly put?
**** How can we bring a deeper foundation for the ethical use of intelligence technology?
** Main References

*** "Who else has attempted anything similar or related to this in the past?"
*** This is not to say that these are necessarily "our" main references
*** [[https://en.wikipedia.org/wiki/Bernard_Stiegler#Books_in_English][Bernard Stiegler]] — philosophy of technics and other works
*** [[https://en.wikipedia.org/wiki/Peter_Sloterdijk#Works_in_English_translation][Peter Sloterdijk]] — philosophy of the human environment
*** James Lovelock — /Novacene: The coming age of hyperintelligence/ — This is good because of the evolutionary perspective, though his reasoning may be a bit off
