manual/combined.tex
\item Other relevant tools in the same space include Org Roam (that one is open source)
\label{sec:orgfb71d50}
\item Logseq itself is open source
\label{sec:orgbb4dc3b}
\item The software is linked with a pseudo-ethical method: zettelkasten
\label{sec:org90e5d61}
\begin{enumerate}
\item \url{https://en.wikipedia.org/wiki/Zettelkasten}
\label{sec:orgf3e1eeb}
\end{enumerate}
\item I previously worked on a paper in this space: Massively distributed authorship of academic papers
\label{sec:org3b94fe2}
Tomlinson, B., Ross, J., André, P., et al. 2012. Massively distributed authorship of academic papers. CHI’12 Extended Abstracts on Human Factors in Computing Systems, ACM, 11–20.
\end{enumerate}



\subsection{How AI can be a force for good}
\label{sec:orgbedef93}

\subsubsection{Distributed agency}
\label{sec:org1c39207}
\begin{quote}
With distributed agency comes distributed responsibility. Existing ethical frameworks address individual, human responsibility, with the goal of allocating punishment or reward based on the actions and intentions of an individual. They were not developed to deal with distributed
responsibility.
\end{quote}
\begin{enumerate}
\item \url{https://drive.google.com/drive/u/1/folders/13bwMQfn8RY67-znVdnC7WO6OdcpDtR83}
\label{sec:org51e0373}
\item This seems like an important point: we'll need new (not necessarily ``agential'') ways to think about ethics.
\label{sec:orgc46ff7a}
\item It seems useful to apply this in somewhat more general terms about ``intelligent systems'' — or just ``systems with emergent properties''; so, if distributed agents produce e.g., environmental degradation, that's not ethical, and the system as a whole ``should'' find ways to improve its behaviour.  This sort of thing is thought about in Elinor Ostrom's economics.
\label{sec:orgf18c1d6}
\item A particular concern of Taddeo \& Floridi here seems to be ``autonomy'' of AI, and ``self-determination'' of humans. But in the case of HCI/HCCC it's not totally clear that either of these criteria apply.  In HCCC it's much closer to anthropotechnics
\label{sec:orgec1cbff}
\begin{enumerate}
\item \url{https://www.wired.com/beyond-the-beyond/2015/09/peter-sloterdijk-anthropotechnics/}
\label{sec:orge37b9c5}
\end{enumerate}
\end{enumerate}

\subsubsection{Regulation}
\label{sec:orgad14d11}
\begin{quote}
Humanity learned this lesson the hard way when it did not regulate the impact of the industrial revolution on labor forces, and also when it recognized too late the environmental impact of massive industrialization and global consumerism.
\end{quote}
\begin{enumerate}
\item I think it's worthwhile to think of these things as \textbf{not separate} from AI issues
\label{sec:orgd9a412b}
\begin{enumerate}
\item Supplementary info:
\label{sec:org688b83f}
\url{https://science.sciencemag.org/content/suppl/2018/08/22/361.6404.751.DC1}
\end{enumerate}
\end{enumerate}
\subsection{Mathematical creativity}
\label{sec:org36972a8}

\subsubsection{Section introduction: Objectives}
\label{sec:org8bbad08}
Have we built up enough of a repertoire to do a deep dive on mathematical creativity?
\subsubsection{What is mathematics? martin heidegger anything learnable as such. Jorge Luís Borges - the map argument;}
\label{sec:org67315d3}
\subsubsection{The end of cognition and human ability? The limits of reality and the limits of math (e.g. dimensionality)}
\label{sec:org5900d63}
\subsubsection{Mathematical creativity as an example - and so what in what ways does it actually ramifies}
\label{sec:orgc390758}

\section{Discussion}
\label{sec:orgb1f7b9a}
\subsubsection{The Discussion is a bit hard to chart in advance, but roughly it asks: having done this survey, and looked at a couple case studies, have we learned anything that's relevant for practice? Maybe here is a good time to return to some of the debates that look at ``creativity'' in a more mainstream sense, e.g., Anna Kantosalo and Ben Schneiderman about creative systems and social inclusion vs exclusion? From the point of view of ``Methods'', hopefully we will have clarified at the start why we think this sort of activity could lead to new insights! Now, at the end, we might draw some conclusions about how ``HCI'' allows us to do global research, build projects involving people from around the world, with rich access to the world’s knowledge resources. We might also have something to say about why Ethical AI is so trendy right now, and perhaps even speculate a bit about its future!}
\label{sec:org2258ed8}
\subsubsection{Some possible places this could go:}
\label{sec:org56ebe9a}
\begin{enumerate}
\item How can I practically engage with these issues as a computer science researcher?
\label{sec:orgc471b6f}
\item Tech design and CS thinking: creativity as mirror of ethical principles
\label{sec:org09ec082}
\item Research Ethics
\label{sec:org282b2fa}
\item Interfaces and establishing relationships between people and things?
\label{sec:orgbc927ef}
\item How do I relate to knowledge, and with/to the whole body of historical philosophy, science, inquiry, and maybe AI and tech systems?
\label{sec:orgf91d822}
\end{enumerate}
\subsection{mind}
\label{sec:orge4b262a}

\begin{enumerate}
\item What does mind mean?
\label{sec:org4c9b9ca}
\item What is mind
\label{sec:org8d5cc07}
\end{enumerate}
\subsection{Premises}
\label{sec:org84f8193}

\subsubsection{We’ve entered into a new era, and we need to understand what’s going on.}
\label{sec:org0c9e273}
\subsubsection{Although part of this is the legacy of the industrial revolution, computers have played a significant role in the growth of knowledge}
\label{sec:org844a366}
\subsubsection{In a certain sense the CS field is playing “catch-up” with CMC: we invent new paradigms for interaction (e.g., Wikipedia, machine learning)}
\label{sec:org36ddcd9}
\subsubsection{However, we don’t yet have a robust way to \emph{think} about human computer interaction at this broad scale}
\label{sec:orgeb52bfc}
\subsubsection{We try to wrap our minds around “Human-Computer Co-Creativity” by looking at CMC, HCI, and CI.}
\label{sec:org4fa03ed}
Let’s work our way up to discussing HCCC by starting with “human
co-creativity using computers”, and introduce AI once we have a grasp
of how computer mediated communication and collective intelligence
works.


\subsection{Scope}
\label{sec:org20e667e}

\subsubsection{TOCHI’s statement of purpose}
\label{sec:org5e2dcfc}

\begin{quote}
ACM Transactions on Computer-Human Interaction (TOCHI) covers the
software, hardware and human aspects of interaction with
computers. Topics include hardware and software architectures;
interactive techniques, metaphors, and evaluation; user interface
design processes; and users and groups of users. Those within the
artificial intelligence, object-oriented systems, information systems,
graphics and software engineering communities, will benefit from the
high quality research papers in TOCHI concerning information and ideas
directly related to the construction of effective human-computer
interfaces.
\end{quote}

\subsubsection{Our research question within this area:}
\label{sec:org9d79ed5}
\begin{enumerate}
\item Is there an ethical use of computer technology, and if so, what is it?  How would we get intuitions about that?
\label{sec:orgfb1dfa6}
\item What is our orientation towards computers broadly put?
\label{sec:orga8e6615}
\item How can we bring a deeper foundation for the ethical use of intelligence technology?
\label{sec:org86e7d06}
\end{enumerate}
\subsection{Main References}
\label{sec:orgaab3331}

\subsubsection{``Who else has attempted anything similar or related to this in the past?''}
\label{sec:orgf925610}
\subsubsection{This is not to say that these are necessarily ``our'' main references}
\label{sec:orge36371e}
\subsubsection{\href{https://en.wikipedia.org/wiki/Bernard\_Stiegler\#Books\_in\_English}{Bernard Stiegler} — philosophy of technics and other works}
\label{sec:org4f14870}
\subsubsection{\href{https://en.wikipedia.org/wiki/Peter\_Sloterdijk\#Works\_in\_English\_translation}{Peter Sloterdijk} — philosophy of the human environment}
\label{sec:orgf808942}
\subsubsection{James Lovelock — \emph{Novacene: The coming age of hyperintelligence} — This is good because of the evolutionary perspective, though his reasoning may be a bit off}
\label{sec:org9416e8b}
\end{document}